# LoadIsCreatedByApi Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ParameterTypeId..::..LoadIsCreatedByApi Property
ParameterTypeId Class See Also
---
"Is created by API"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadIsCreatedByApi { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadIsCreatedByApi As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadIsCreatedByApi {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace